chanvenjoe/STM32-learning/Projects/N76E003_BSP_Keil_C51_V1.0.6/RF 36V motor controller 25A/Code/Motor_control.c
#include "Motor_control.h"
#include "common.h"
#include "Function_define.h"
#include "N76E003.h"
#include "SFR_Macro.h"
#include "Delay.h"

#define Vref  3072;
#define set_IAPEN BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;CHPCON|=SET_BIT0 ;EA=BIT_TMP
#define set_IAPGO BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;IAPTRG|=SET_BIT0 ;EA=BIT_TMP
#define clr_IAPEN BIT_TMP=EA;EA=0;TA=0xAA;TA=0x55;CHPCON&=~SET_BIT0;EA=BIT_TMP
////////////Variables////////////////
double bgvalue, ADCValue, bgvol, ADC_Vol;
uint8_t  bgh;
uint8_t  bgl;



void ADC_Init(void)
{
	set_P14; //Enable DCDC
	set_IAPEN;
	IAPAL = 0x0c; IAPAH = 0x00; IAPCN = 0x04;
	set_IAPGO;
	bgh = IAPFD;
	IAPAL = 0x0d;
	IAPAH = 0x00; IAPCN = 0x04;
	set_IAPGO;
	bgl = IAPFD;
	bgl = bgl&0x0f; // lower four bits 
	bgvalue=(bgh<<4)+bgl;
	bgvol= bgvalue*3/4;
	printf("\nBandgap value:%x\n", bgvalue);
	printf("\nBandgap voltage:%dmV\n",bgvol);
	clr_IAPEN;		// turn off IAP
//	Enable_ADC_AIN4;		//P05 A_Det
//	Enable_ADC_AIN1;		//P30 Speed
}

UINT8 Get_HallValue(void)
{
	Enable_ADC_AIN0;			//P17 Hall pedal
	clr_ADCF;
	set_ADCS;
	ADCValue = (ADCRH<<4)+ADCRL;
	ADC_Vol = bgvol*ADCValue/bgvalue;
	printf("ADC_voltage:%gmV\n",ADC_Vol);//%g don't print no meaning 0
	if(ADC_Vol>1000)
	{
		return ADC_Vol;
	}
	else return 0;
}

void PWM_Init()
{
	PWM3_P04_OUTPUT_ENABLE;//Upper bridge
	PWM4_P01_OUTPUT_ENABLE;
	PWM_CLOCK_DIV_8;
	PWM_IMDEPENDENT_MODE;
	PWMPH = 0x00;  //Period setting;
	PWMPL = 0x7a;	//14KHz
	PWM3_OUTPUT_INVERSE;
	PWM3H = 0x00;
	PWM3L = 0x00;
	PWM4H = 0x00;
	PWM4L = 0x00;
	/**********************************************************************
	PWM frequency = Fpwm/((PWMPH,PWMPL) + 1) <Fpwm = Fsys/PWM_CLOCK_DIV> 
								= (16MHz/8)/(0x7CF + 1)
								= 1KHz (1ms)
***********************************************************************/
}

void PWM_Setting(double n)	//1n = 1%
{
	set_SFRPAGE; //PWM4\5 SETTING
	if(n>=20)
	{
		UINT16 i = n;
		PWM4H = (0xff00|i)>>8;
		PWM4L = (0xff|i);
//		PWM5H = 0x05;
//		PWM5L = 0xCF;
	}
	else if(n>=100)
	{
		PWM4H = 0x00; PWM4L = 0x7a; //100%PWM
		PWM3H = 0x00; PWM3L = 0x7a;
	}
	else
	{
		PWM4H = 0x00; PWM4L = 0x00; //
		PWM3H = 0x00; PWM3L = 0x00;
	}
	set_LOAD;
	set_PWMRUN;
}
